DataProcessors/ПанельАдминистрированияИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ПанельАдминистрированияИСМП</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиУчетаМаркируемойПродукцииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаМаркируемойПродукцииИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственногоЗаказа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственнойЛинии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроизводственныйОбъектИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъектИдентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъектАдрес</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъектАдресСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаНачалаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВвезенПослеДатыОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриобретенПроизведенПослеДатыОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПровайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисПровайдерыСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторЗаявкиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплатыКодовМаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатыКодовМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораСОператором</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговораСОператором</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидСредстваИдентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСредствИдентификацииСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидМаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLNОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GLN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияИзготовленныхКИЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СерийныеНомера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Comment>Код товара в ИС МП</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ШаблоныКодовМаркировкиСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяРозничнаяЦена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособФормированияСерийногоНомера</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыФормированияСерийногоНомераСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевойПол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦелевойПолИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВводаВОборот</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварныйЗнак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозрастнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВозрастныеКатегорииИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьШаблонЭтикетки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УдалитьШаблоныЭтикетокСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКИЗ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКиЗГИСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерКИЗ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РазмерыКиЗГИСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиВладельца</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВладелецGTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПанельАдминистрированияИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

Процедура ВключитьПроверкуРозничнымМетодомДляОпределенныхТоварныхГрупп() Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		ВедетсяУчетПродукцииТребующейОбязательнойОнлайнПроверки = РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.ВедетсяУчетПродукцииТребующейОбязательнойОнлайнПроверки();
		
		Если ВедетсяУчетПродукцииТребующейОбязательнойОнлайнПроверки Тогда
		
			Если Не Константы.ЗапрашиватьДанныеСервисаИСМП.Получить() Тогда
				
				МетаданныеОбъекта  = Метаданные.Константы.ЗапрашиватьДанныеСервисаИСМП;
				ПолноеИмяОбъекта   = МетаданныеОбъекта.ПолноеИмя();
				
				Блокировка = Новый БлокировкаДанных;
			
				ЭлементБлокировки       = Блокировка.Добавить(ПолноеИмяОбъекта);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				
				ЭлементБлокировки       = Блокировка.Добавить(ПолноеИмяОбъекта);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				
				Блокировка.Заблокировать();
				
				Константы.ЗапрашиватьДанныеСервисаИСМП.Установить(Истина);
				
			КонецЕсли;
			
			Блокировка = Новый БлокировкаДанных;
			
			МетаданныеОбъекта  = Метаданные.Константы.НастройкиСканированияКодовМаркировкиИСМП;
			ПолноеИмяОбъекта   = МетаданныеОбъекта.ПолноеИмя();
			
			ЭлементБлокировки       = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			ТекущиеНастройкиСканирования = ИнтеграцияИСМПВызовСервера.НастройкиСканированияКодовМаркировки();
			
			Если Не ТекущиеНастройкиСканирования.ПараметрыКонтроляВладельцев.Включено Тогда
			
				ОграниченияНастроек                = НастройкаПараметровСканированияСлужебныйКлиентСервер.НоваяГруппаПараметровНастройки(Истина);
				МассивТГОбязательнойОнлайнПроверки = ИнтеграцияИСМПКлиентСерверПовтИсп.ВидыПродукцийОбязательнойОнлайнПроверкиПередРозничнойПродажей();
				УчитываемыеТГ                      = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
				
				ОграниченияНастроек.ВариантОтображения = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				
				Для Каждого УчитываемаяТГ Из УчитываемыеТГ Цикл
					
					СоответствиеИсключений = Новый Соответствие();
					ОграниченияНастроек.Исключения.Вставить(УчитываемаяТГ, СоответствиеИсключений);
					
				КонецЦикла;
				
				ОграниченияНастроек.Включено = Истина;
				ТекущиеНастройкиСканирования.ПараметрыКонтроляВладельцев = ОграниченияНастроек;
			
				Если Не ТекущиеНастройкиСканирования.ПараметрыКонтроляСтатусов.Включено Тогда
				
					ТекущиеНастройкиСканирования.ПараметрыКонтроляСтатусов = ОграниченияНастроек;
				
				Иначе
					
					Для Каждого ТГОбязательнойПроверки Из МассивТГОбязательнойОнлайнПроверки Цикл
					
						ИсключенияКонтроляСтатусовПоТГ = ТекущиеНастройкиСканирования.ПараметрыКонтроляСтатусов.Исключения.Получить(ТГОбязательнойПроверки);
						
						Если ИсключенияКонтроляСтатусовПоТГ <> Неопределено Тогда
							
							Для Каждого ЗначениеОперации Из ИсключенияКонтроляСтатусовПоТГ Цикл
								
								Если ЗначениеОперации.Ключ = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа И ЗначениеОперации.Значение Тогда
									ИсключенияКонтроляСтатусовПоТГ.Удалить(Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа);
								КонецЕсли;
								
							КонецЦикла;
							
							Если ИсключенияКонтроляСтатусовПоТГ.Количество() Тогда
								ТекущиеНастройкиСканирования.ПараметрыКонтроляСтатусов.Исключения.Вставить(ТГОбязательнойПроверки, ИсключенияКонтроляСтатусовПоТГ);
							Иначе
								ТекущиеНастройкиСканирования.ПараметрыКонтроляСтатусов.Исключения.Удалить(ТГОбязательнойПроверки);
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				МассивТГОбязательнойОнлайнПроверки = ИнтеграцияИСМПКлиентСерверПовтИсп.ВидыПродукцийОбязательнойОнлайнПроверкиПередРозничнойПродажей();
				
				Для Каждого ТГОбязательнойПроверки Из МассивТГОбязательнойОнлайнПроверки Цикл
					
					НастройкиИзменены                = Ложь;
					ИсключенияКонтроляВладельцевПоТГ = ТекущиеНастройкиСканирования.ПараметрыКонтроляВладельцев.Исключения.Получить(ТГОбязательнойПроверки);
					
					Если ИсключенияКонтроляВладельцевПоТГ <> Неопределено Тогда
						
						Для Каждого ЗначениеОперации Из ИсключенияКонтроляВладельцевПоТГ Цикл
							
							Если ЗначениеОперации.Ключ = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа И ЗначениеОперации.Значение Тогда
								ИсключенияКонтроляВладельцевПоТГ.Удалить(Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа);
								НастройкиИзменены = Истина;
							КонецЕсли;
							
						КонецЦикла;
						
						Если ИсключенияКонтроляВладельцевПоТГ.Количество() Тогда
							ТекущиеНастройкиСканирования.ПараметрыКонтроляВладельцев.Исключения.Вставить(ТГОбязательнойПроверки, ИсключенияКонтроляВладельцевПоТГ);
						ИначеЕсли НастройкиИзменены Тогда
							ТекущиеНастройкиСканирования.ПараметрыКонтроляВладельцев.Исключения.Удалить(ТГОбязательнойПроверки);
						КонецЕсли;
						
					КонецЕсли;

					НастройкиИзменены                = Ложь;
					ИсключенияКонтроляСтатусовПоТГ = ТекущиеНастройкиСканирования.ПараметрыКонтроляСтатусов.Исключения.Получить(ТГОбязательнойПроверки);
					
					Если ИсключенияКонтроляСтатусовПоТГ <> Неопределено Тогда
						
						Для Каждого ЗначениеОперации Из ИсключенияКонтроляСтатусовПоТГ Цикл
							
							Если ЗначениеОперации.Ключ = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа И ЗначениеОперации.Значение Тогда
								ИсключенияКонтроляСтатусовПоТГ.Удалить(Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа);
								НастройкиИзменены = Истина;
							КонецЕсли;
							
						КонецЦикла;
						
						Если ИсключенияКонтроляСтатусовПоТГ.Количество() Тогда
							ТекущиеНастройкиСканирования.ПараметрыКонтроляСтатусов.Исключения.Вставить(ТГОбязательнойПроверки, ИсключенияКонтроляСтатусовПоТГ);
						ИначеЕсли НастройкиИзменены Тогда
							ТекущиеНастройкиСканирования.ПараметрыКонтроляСтатусов.Исключения.Удалить(ТГОбязательнойПроверки);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Константы.НастройкиСканированияКодовМаркировкиИСМП.Установить(Новый ХранилищеЗначения(ТекущиеНастройкиСканирования));
		
			ОбновитьПовторноИспользуемыеЗначения();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОбработкаЗавершена = Ложь;
		
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось обновить исключения по товарным группам, требующим обязательного онлайн-контроля при продаже в розницу, по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		                         УровеньЖурналаРегистрации.Предупреждение,
		                         МетаданныеОбъекта,,
		                         ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеДляОбновленияИсключенийКонтроляСтатусовИВладельцев(Параметры) Экспорт
	
	Возврат;

КонецПроцедуры

Процедура ОбработатьДанныеДляОбновленияИсключенийКонтроляСтатусовИВладельцев(Параметры) Экспорт
	
	ОбработкаЗавершена = Истина;
	
	ВключитьПроверкуРозничнымМетодомДляОпределенныхТоварныхГрупп();
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюРаздельныйКонтрольСтатусовВладельцевКМ(Параметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюРаздельныйКонтрольСтатусовВладельцевКМ(Параметры) Экспорт
	
	МетаданныеОбъекта  = Метаданные.Константы.ЗапрашиватьДанныеСервисаИСМП;
	ПолноеИмяОбъекта   = МетаданныеОбъекта.ПолноеИмя();
	ОбработкаЗавершена = Истина;
	
	ПредыдущееЗначениеКонтроляСтатусов        = Константы.ЗапрашиватьДанныеСервисаИСМП.Получить();
	ПредыдущееЗначениеКонтроляСтатусовРозница = Константы.УдалитьКонтролироватьСтатусыКодовМаркировкиВРозницеИСМП.Получить();
	
	Если ПредыдущееЗначениеКонтроляСтатусов
		Или ПредыдущееЗначениеКонтроляСтатусовРозница Тогда
		
		ПараметрыКонтроля = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ПараметрыКонтроля();
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки       = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки       = Блокировка.Добавить(Метаданные.Константы.НастройкиСканированияКодовМаркировкиИСМП.ПолноеИмя());
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			НастройкиСканирования = ИнтеграцияИСМПВызовСервера.НастройкиСканированияКодовМаркировки();
		
			ГруппаНастроекКонтрольСтатусов = НастройкаПараметровСканированияСлужебныйКлиентСервер.ЗначениеГруппыНастроек(
				НастройкиСканирования,
				ПараметрыКонтроля.ПараметрыКонтроляСтатусов);
			ГруппаНастроекКонтрольСтатусов.Включено   = Истина;
			ГруппаНастроекКонтрольСтатусов.Исключения = Новый Соответствие();
			
			ГруппаНастроекКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСервер.ЗначениеГруппыНастроек(
				НастройкиСканирования,
				ПараметрыКонтроля.ПараметрыКонтроляВладельцев);
			ГруппаНастроекКонтрольВладельцев.Включено   = Истина;
			ГруппаНастроекКонтрольВладельцев.Исключения = Новый Соответствие();
			
			УчитываемыеВидыТабак = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции(Ложь, Истина);
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка
			|ИЗ
			|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
			|ГДЕ
			|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка.Проведен
			|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.GTIN <> """"
			|	И ПОДСТРОКА(ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.GTIN, 1, 3) <> ""029""
			|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка.ВидПродукции В (&УчитываемыеВидыТабак)";
			
			Запрос.УстановитьПараметр("УчитываемыеВидыТабак", УчитываемыеВидыТабак);
			
			ДобавитьИсключениеКонтрольВладельцевТабакАТП = (Не Запрос.Выполнить().Пустой());
			УчитываемыеВидыМаркируемойПродукции          = ИнтеграцияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
			ВсеОперации                                  = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ДопустимыеВидыОпераций().ВыгрузитьЗначения();
			ВариантОтображенияКонтрольСтатусов           = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции();
			ВариантОтображенияКонтрольВладельцев         = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции();
			
			ОперацииИсключений        = Новый Массив();
			ОперацииРозничнойТорговли = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ОперацииРозничнойТорговли();
			
			Если ПредыдущееЗначениеКонтроляСтатусов
				И Не ПредыдущееЗначениеКонтроляСтатусовРозница Тогда
				
				ОперацииИсключений                   = ОперацииРозничнойТорговли;
				ВариантОтображенияКонтрольСтатусов   = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				
			ИначеЕсли ПредыдущееЗначениеКонтроляСтатусовРозница
				И Не ПредыдущееЗначениеКонтроляСтатусов Тогда
				
				ОперацииИсключений                   = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВсеОперации, ОперацииРозничнойТорговли);
				ВариантОтображенияКонтрольСтатусов   = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				
			КонецЕсли;
			
			Для Каждого ВидПродукции Из УчитываемыеВидыМаркируемойПродукции Цикл
				
				Для Каждого Операция Из ОперацииИсключений Цикл
					
					НастройкаПараметровСканированияСлужебныйКлиентСервер.ДобавитьВИсключение(
						ГруппаНастроекКонтрольСтатусов,
						ВидПродукции,
						Операция);
					
					НастройкаПараметровСканированияСлужебныйКлиентСервер.ДобавитьВИсключение(
						ГруппаНастроекКонтрольВладельцев,
						ВидПродукции,
						Операция);
					
				КонецЦикла;
				
			КонецЦикла;
			
			Если ДобавитьИсключениеКонтрольВладельцевТабакАТП Тогда
				
				Для Каждого ВидПродукции Из УчитываемыеВидыТабак Цикл
					
					ГруппаНастроекКонтрольВладельцев.Исключения.Вставить(ВидПродукции, Новый Соответствие());
					
				КонецЦикла;
				
				ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции();
				
			КонецЕсли;
			
			Если УчитываемыеВидыМаркируемойПродукции.Количество() = 1 Тогда
				Если ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции() Тогда
					ВариантОтображенияКонтрольВладельцев = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				КонецЕсли;
				Если ВариантОтображенияКонтрольСтатусов = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоВидамПродукции() Тогда
					ВариантОтображенияКонтрольСтатусов = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ВариантОтображенияПоОперациям();
				КонецЕсли;
			КонецЕсли;
			
			ГруппаНастроекКонтрольВладельцев.ВариантОтображения = ВариантОтображенияКонтрольВладельцев;
			ГруппаНастроекКонтрольСтатусов.ВариантОтображения   = ВариантОтображенияКонтрольСтатусов;
				
			ЗначениеКонстантыНастроек = Новый ХранилищеЗначения(НастройкиСканирования);
			Константы.НастройкиСканированияКодовМаркировкиИСМП.Установить(ЗначениеКонстантыНастроек);
			Константы.ЗапрашиватьДанныеСервисаИСМП.Установить(Истина);
			
			ОбновитьПовторноИспользуемыеЗначения();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОбработкаЗавершена = Ложь;
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обработать переход на раздельный контроль статусов и кодов макрировки по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Предупреждение,
			                         МетаданныеОбъекта,,
			                         ТекстСообщения);
			
		КонецПопытки;
		
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
